[
    {
        "question": "Что является характеристикой отказоустойчивой сети?",
        "answers": [
            "сеть, защищающая конфиденциальную информацию от несанкционированного доступа",
            "сеть, которая может быстро расширяться для поддержки новых пользователей и приложений без влияния на производительность услуг, предоставляемых существующим пользователям",
            "сеть, которая поддерживает механизм для управления перегрузками и обеспечения надежной доставки контента всем пользователям",
            "сеть, которая быстро восстанавливается после сбоя и зависит от избыточности для ограничения последствий сбоя"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Три сотрудника банка используют корпоративную сеть. Первый сотрудник использует веб-браузер для просмотра веб-страницы компании, чтобы ознакомиться с некоторыми объявлениями. Второй сотрудник получает доступ к корпоративной базе данных для выполнения некоторых финансовых операций. Третий сотрудник участвует в важной аудиоконференции с другими менеджерами компании в филиалах. Если в этой сети будет реализовано QoS, каковы будут приоритеты различных типов данных от высшего к низшему?",
        "answers": [
            "аудиоконференция, финансовые операции, веб-страница",
            "финансовые операции, веб-страница, аудиоконференция",
            "аудиоконференция, веб-страница, финансовые операции",
            "финансовые операции, аудиоконференция, веб-страница"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "В чем преимущество использования облачных вычислений в сетевых технологиях?",
        "answers": [
            "Конечные пользователи могут свободно использовать личные инструменты для доступа к информации и общения в деловой сети.",
            "Расширение возможностей сети не требует инвестиций в новую инфраструктуру, персонал или программное обеспечение.",
            "Технологии интегрируются в повседневные приборы, позволяя им соединяться с другими устройствами, делая их более \"умными\" или автоматизированными.",
            "Домашняя сеть использует существующую электропроводку для подключения устройств к сети везде, где есть электрическая розетка, что позволяет сократить расходы на прокладку кабелей передачи данных."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какова функция оболочки в ОС?",
        "answers": [
            "Он взаимодействует с аппаратным обеспечением устройства.",
            "Он обеспечивает взаимодействие между пользователями и ядром.",
            "Он предоставляет выделенные услуги межсетевого экрана.",
            "Он предоставляет услуги по защите от вторжений для устройства."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какое соединение обеспечивает безопасный сеанс CLI с шифрованием для коммутатора Cisco?",
        "answers": [
            "консольное соединение",
            "подключение AUX",
            "соединение Telnet",
            "SSH-соединение"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Сетевой специалист пытается настроить интерфейс, введя следующую команду: SanJose(config)# ip address 192.168.2.1 255.255.255.0. Команда отклоняется устройством. Какова причина этого?",
        "answers": [
            "Команда вводится из неправильного режима работы.",
            "Синтаксис команды неверен.",
            "Информация о маске подсети неверна.",
            "Интерфейс выключен и должен быть включен, прежде чем коммутатор примет IP-адрес."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Администратор использует комбинацию клавиш Ctrl-Shift-6 на коммутаторе после выдачи команды ping. Какова цель использования этих клавиш?",
        "answers": [
            "чтобы перезапустить процесс пинга",
            "прервать процесс пинга",
            "для выхода в другой режим конфигурации",
            "чтобы позволить пользователю выполнить команду"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "На каком интерфейсе коммутатора администратор настроит IP-адрес, чтобы коммутатором можно было управлять удаленно?",
        "answers": [
            "FastEthernet0/1",
            "VLAN 1",
            "vty 0",
            "console 0"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какой протокол отвечает за управление размером сегментов и скоростью обмена сегментами между веб-клиентом и веб-сервером?",
        "answers": [
            "TCP",
            "IP",
            "HTTP",
            "Ethernet"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "В чем преимущество использования протокола, который определен открытым стандартом?",
        "answers": [
            "Компания может монополизировать рынок.",
            "Протокол может работать только на оборудовании определенного производителя.",
            "Протокол открытого стандарта не контролируется и не регулируется организациями по стандартизации.",
            "Это поощряет конкуренцию и способствует выбору."
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Каковы два преимущества использования многоуровневой модели сети? (Выберите два.)",
        "answers": [
            "Это помогает в разработке протокола.",
            "Это ускоряет доставку пакетов.",
            "Это мешает дизайнерам создавать свою собственную модель.",
            "Это предотвращает влияние технологии в одном слое на другие слои.",
            "Это гарантирует, что устройство на одном уровне может функционировать на следующем более высоком уровне."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какие два уровня модели OSI имеют ту же функциональность, что и два уровня модели TCP/IP? (Выберите два.)",
        "answers": [
            "data link",
            "network",
            "physical",
            "session",
            "transport"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какое имя присваивается PDU транспортного уровня?",
        "answers": [
            "bits",
            "data",
            "frame",
            "packet",
            "segment"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Сетевой администратор устраняет проблемы с подключением на сервере. Используя тестер, администратор замечает, что сигналы, генерируемые сетевой картой сервера, искажены и непригодны для использования. На каком уровне модели OSI классифицируется ошибка?",
        "answers": [
            "presentation layer",
            "network layer",
            "physical layer",
            "data link layer"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Сетевой администратор измеряет передачу битов по магистрали компании для критически важного финансового приложения. Администратор замечает, что пропускная способность сети кажется ниже ожидаемой. Какие три фактора могут повлиять на разницу в пропускной способности? (Выберите три.)",
        "answers": [
            "объем трафика, который в настоящее время проходит через сеть",
            "сложность метода инкапсуляции, применяемого к данным",
            "тип трафика, проходящего через сеть",
            "задержка, создаваемая количеством сетевых устройств, через которые проходят данные",
            "пропускная способность WAN-соединения с Интернетом",
            "надежность инфраструктуры гигабитного Ethernet магистрали"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Что является характеристикой кабеля UTP?",
        "answers": [
            "отмена",
            "облицовка",
            "невосприимчивость к электрическим опасностям",
            "плетеная медная оплетка или металлическая фольга"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Каковы две характеристики волоконно-оптического кабеля? (Выберите две.)",
        "answers": [
            "Он не подвержен воздействию электромагнитных и радиочастотных помех.",
            "Каждая пара кабелей обернута металлической фольгой.",
            "Он сочетает в себе технику отмены, экранирования и скручивания для защиты данных.",
            "Обычно он содержит 4 пары волоконно-оптических проводов.",
            "Он стоит дороже, чем кабели UTP."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Что является характеристикой подуровня LLC? ",
        "answers": [
            "Он обеспечивает необходимую логическую адресацию, которая идентифицирует устройство.",
            "Она обеспечивает разграничение данных в соответствии с требованиями физической сигнализации среды.",
            "Он размещает информацию в кадре, позволяя нескольким протоколам уровня 3 использовать один и тот же сетевой интерфейс и носитель.",
            "Он определяет программные процессы, которые предоставляют услуги физическому уровню."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Сетевая команда сравнивает физические топологии WAN для подключения удаленных сайтов к зданию штаб-квартиры. Какая топология обеспечивает высокую доступность и соединяет некоторые, но не все удаленные сайты?",
        "answers": [
            "сетка",
            "частичная сетка",
            "втулка и спица",
            "точка-точка"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какой метод используется для управления доступом на основе соперничества в беспроводной сети?",
        "answers": [
            "CSMA/CD",
            "priority ordering",
            "CSMA/CA",
            "token passing"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какие три основные функции обеспечивает инкапсуляция данных на уровне 2? (Выберите три.)",
        "answers": [
            "исправление ошибок с помощью метода обнаружения столкновений",
            "управление сеансами с помощью номеров портов",
            "адресация на канальном уровне",
            "размещение и удаление кадров из носителя",
            "обнаружение ошибок с помощью вычислений CRC",
            "разделение групп битов на кадры",
            "преобразование битов в сигналы данных"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Что будет делать узел в сети Ethernet, если он получит кадр с MAC-адресом назначения, который не совпадает с его собственным MAC-адресом?",
        "answers": [
            "Это приведет к отбрасыванию кадра.",
            "Он пересылает кадр следующему узлу.",
            "Это позволит удалить рамку с носителя.",
            "Он отделяет кадр канала передачи данных, чтобы проверить IP-адрес назначения."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какой метод пересылки кадров получает весь кадр и выполняет проверку CRC для обнаружения ошибок перед пересылкой кадра?",
        "answers": [
            "сквозное переключение",
            "переключение с сохранением и переадресацией",
            "бесфрагментное переключение",
            "переключение вперед и назад"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какие адреса сопоставляются с помощью ARP?",
        "answers": [
            "MAC-адрес назначения на IPv4-адрес назначения",
            "IPv4-адрес назначения на MAC-адрес источника",
            "IPv4-адрес назначения в имя хоста назначения",
            "MAC-адрес назначения на IPv4-адрес источника"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какие две услуги предоставляет сетевой уровень OSI? (Выберите две.)",
        "answers": [
            "выполнение обнаружения ошибок",
            "маршрутизация пакетов к месту назначения",
            "инкапсуляция PDU с транспортного уровня",
            "размещение кадров на носителе",
            "обнаружение столкновений"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Каковы две функции NVRAM? (Выберите две.)",
        "answers": [
            "для хранения таблицы маршрутизации",
            "для сохранения содержимого при отключении питания",
            "для хранения файла конфигурации запуска",
            "содержать файл текущей конфигурации",
            "для хранения таблицы ARP"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Каково точечное десятичное представление адреса IPv4 11001011.00000000.01110001.11010011?",
        "answers": [
            "192.0.2.199",
            "198.51.100.201",
            "203.0.113.211",
            "209.165.201.223"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Каковы три характеристики многоадресной передачи? (Выберите три.)",
        "answers": [
            "Адрес источника многоадресной передачи находится в диапазоне от 224.0.0.0 до 224.0.0.255.",
            "Один пакет может быть отправлен группе хостов.",
            "Многоадресная передача может использоваться маршрутизаторами для обмена информацией о маршрутизации.",
            "Маршрутизаторы не будут пересылать многоадресные адреса в диапазоне от 224.0.0.0 до 224.0.0.255.",
            "Компьютеры используют многоадресную передачу для запроса адресов IPv4.",
            "Многоадресные сообщения отображают адреса нижнего уровня на адреса верхнего уровня."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какие три диапазона IP-адресов зарезервированы для внутреннего частного использования? (Выберите три.)",
        "answers": [
            "10.0.0.0/8",
            "64.100.0.0/14",
            "127.16.0.0/12",
            "172.16.0.0/12",
            "192.31.7.0/24",
            "192.168.0.0/16"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Для какой цели служит NAT64 в IPv6?",
        "answers": [
            "Он преобразует пакеты IPv6 в пакеты IPv4.",
            "Он переводит частные IPv6-адреса в публичные IPv6-адреса.",
            "Это позволяет компаниям использовать в сети уникальные локальные адреса IPv6.",
            "Он преобразует обычные адреса IPv6 в 64-битные адреса, которые можно использовать в Интернете.",
            "Он преобразует 48-битный MAC-адрес в 64-битный адрес хоста, который может быть использован для автоматической адресации хостов."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Каково наиболее сжатое представление адреса IPv6 2001:0000:0000:abcd:0000:0000:0000:0001?",
        "answers": [
            "2001:0:abcd::1",
            "2001:0:0:abcd::1",
            "2001::abcd::1",
            "2001:0000:abcd::1",
            "2001::abcd:0:1"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какой диапазон локальных адресов канала может быть назначен интерфейсу с поддержкой IPv6?​",
        "answers": [
            "FEC0::/10​",
            "FDEE::/7​",
            "FE80::/10",
            "FF00::/8​"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Сколько действительных адресов хостов доступно в подсети IPv4, которая настроена с маской /26?",
        "answers": [
            "254",
            "190",
            "192",
            "62",
            "64"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Администратору сайта сообщили, что определенная сеть на сайте должна вмещать 126 хостов. Какая маска подсети будет использоваться, содержащая необходимое количество битов хостов?",
        "answers": [
            "255.255.255.0",
            "255.255.255.128",
            "255.255.255.224",
            "255.255.255.240"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какая подсеть будет включать адрес 192.168.1.96 в качестве полезного адреса хоста?",
        "answers": [
            "192.168.1.64/26",
            "192.168.1.32/27",
            "192.168.1.32/28",
            "192.168.1.64/29"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какое утверждение верно в отношении маскирования подсети переменной длины?",
        "answers": [
            "Каждая подсеть имеет одинаковый размер.",
            "Размер каждой подсети может быть разным, в зависимости от требований.",
            "Подсети можно объединять в подсети только один дополнительный раз.",
            "Биты возвращаются, а не заимствуются, для создания дополнительных подсетей."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какой сценарий описывает функцию, обеспечиваемую транспортным уровнем?",
        "answers": [
            "Студент использует VoIP-телефон в классе для звонков домой. Уникальный идентификатор, записанный в телефон, является адресом транспортного уровня, используемым для связи с другим сетевым устройством в той же сети.",
            "Студент воспроизводит короткий веб-фильм со звуком. Фильм и звук закодированы в заголовке транспортного уровня.",
            "У студента открыты два окна веб-браузера для доступа к двум веб-сайтам. Транспортный уровень обеспечивает доставку нужной веб-страницы в нужное окно браузера.",
            "Сотрудник компании обращается к веб-серверу, расположенному в корпоративной сети. Транспортный уровень форматирует экран, чтобы веб-страница отображалась правильно независимо от того, какое устройство используется для просмотра веб-сайта."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Пользователь открывает три браузера на одном компьютере, чтобы получить доступ к сайту http://www.cisco.com для поиска информации о курсах сертификации. Веб-сервер Cisco отправляет дейтаграмму в ответ на запрос одного из веб-браузеров. Какая информация используется стеком протоколов TCP/IP в ПК для определения того, какой из трех веб-браузеров должен получить ответ?",
        "answers": [
            "IP-адрес назначения",
            "номер порта назначения",
            "IP-адрес источника",
            "номер порта источника"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какими двумя способами TCP использует порядковые номера в сегменте? (Выберите два.)",
        "answers": [
            "для определения отсутствующих сегментов в пункте назначения",
            "для сборки сегментов на удаленном объекте",
            "для указания порядка, в котором сегменты перемещаются от источника к месту назначения",
            "ограничить количество сегментов, которые могут быть отправлены с интерфейса за один раз",
            "чтобы определить, изменился ли пакет во время транспортировки"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какие две задачи являются функциями презентационного уровня? (Выберите две.)",
        "answers": [
            "сжатие",
            "обращение по адресу",
            "шифрование",
            "управление сессией",
            "аутентификация"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Что является ключевой характеристикой модели одноранговой сети?",
        "answers": [
            "беспроводная сеть",
            "социальные сети без интернета",
            "сетевая печать с использованием сервера печати",
            "совместное использование ресурсов без выделенного сервера"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Технический специалист может пинговать IP-адрес веб-сервера удаленной компании, но не может успешно пинговать URL-адрес того же веб-сервера. Какую программную утилиту может использовать техник для диагностики проблемы?",
        "answers": [
            "tracert",
            "ipconfig",
            "netstat",
            "nslookup"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Какое доменное имя является примером домена верхнего уровня?",
        "answers": [
            "www.cisco.com",
            "cisco.com",
            ".com",
            "root.cisco.com"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "ПК получает свой IP-адрес от сервера DHCP. Если ПК отключен от сети для ремонта, что произойдет с конфигурацией IP-адреса?",
        "answers": [
            "Конфигурация является постоянной и ничего не меняется.",
            "Аренда адреса автоматически продлевается до тех пор, пока ПК не будет возвращен.",
            "Адрес возвращается в пул для повторного использования по истечении срока аренды.",
            "Конфигурация хранится на сервере, чтобы быть повторно выданной при возврате ПК."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Беспроводной хост должен запросить IP-адрес. Какой протокол будет использоваться для обработки запроса?",
        "answers": [
            "FTP",
            "HTTP",
            "DHCP",
            "ICMP",
            "SNMP"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какой пример вредоносного кода можно отнести к категории \"троянский конь\"?",
        "answers": [
            "вредоносное ПО, которое было написано так, чтобы выглядеть как видеоигра",
            "вредоносные программы, для распространения между системами которых требуется ручное вмешательство пользователя",
            "вредоносное ПО, которое прикрепляется к легитимной программе и при запуске распространяется на другие программы",
            "вредоносное ПО, которое может автоматически распространяться от одной системы к другой, используя уязвимость в целевой системе"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Если применить ее к маршрутизатору, какая команда поможет смягчить атаки на маршрутизатор методом перебора паролей?",
        "answers": [
            "exec-timeout 30",
            "service password-encryption",
            "banner motd $Max failed logins = 5$",
            "login block-for 60 attempts 5 within 60"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Сетевой специалист подозревает, что определенное сетевое соединение между двумя коммутаторами Cisco имеет несоответствие дуплекса. Какую команду техник должен использовать, чтобы просмотреть информацию об уровне 1 и уровне 2 порта коммутатора?",
        "answers": [
            "show interfaces",
            "show running-config",
            "show ip interface brief​",
            "show mac-address-table"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Куда по умолчанию отправляются отладочные выходные сообщения Cisco IOS?",
        "answers": [
            "буферы памяти",
            "vty-линии",
            "Сервер Syslog",
            "консольная линия"
        ],
        "correctAnswer": "3"
    }
]