[
    {
        "question": "Компания расширяет свой бизнес в другие страны. Все филиалы должны постоянно оставаться подключенными к головному офису компании. Какая сетевая технология необходима для выполнения этого требования?",
        "answers": [
            "LAN",
            "MAN",
            "WAN",
            "WLAN"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Домашнему пользователю требуется подключение к интернет-провайдеру, обеспечивающее высокоскоростную цифровую передачу по обычным телефонным линиям. Какой тип ISP-соединения следует использовать?",
        "answers": [
            "DSL",
            "dial-up",
            "satellite",
            "cell modem",
            "cable modem"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Как качество обслуживания помогает сети поддерживать широкий спектр приложений и услуг?",
        "answers": [
            "ограничивая воздействие сбоев в работе сети",
            "благодаря возможности быстрого восстановления после сбоев в сети",
            "путем предоставления механизмов для управления перегруженным сетевым трафиком",
            "обеспечивая возможность роста сети для приема новых пользователей"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "На каком интерфейсе коммутатора администратор настроит IP-адрес, чтобы коммутатором можно было управлять удаленно?",
        "answers": [
            "FastEthernet0/1",
            "VLAN 1",
            "vty 0",
            "console 0"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "После внесения изменений в конфигурацию коммутатора Cisco сетевой администратор выдает команду copy running-config startup-config. Каков результат выполнения этой команды?",
        "answers": [
            "Новая конфигурация будет сохранена во флэш-памяти.",
            "Новая конфигурация будет загружена при перезапуске коммутатора.",
            "Текущий файл IOS будет заменен новым настроенным файлом.",
            "Изменения конфигурации будут удалены, а исходная конфигурация восстановлена."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какое соединение обеспечивает безопасный сеанс CLI с шифрованием для коммутатора Cisco?",
        "answers": [
            "a console connection",
            "an AUX connection",
            "a Telnet connection",
            "an SSH connection"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Сетевой специалист пытается настроить интерфейс, введя следующую команду: SanJose(config)# ip address 192.168.2.1 255.255.255.0. Команда отклоняется устройством. Какова причина этого?",
        "answers": [
            "Команда вводится из неправильного режима работы.",
            "Синтаксис команды неверен.",
            "Информация о маске подсети неверна.",
            "Интерфейс выключен и должен быть включен, прежде чем коммутатор примет IP-адрес."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какую функцию выполняет нажатие клавиши Tab при вводе команды в IOS?",
        "answers": [
            "Это прерывает выполнение текущей команды и возвращает в режим конфигурации.",
            "Он выходит из режима конфигурации и возвращается в режим EXEC пользователя.",
            "Он перемещает курсор в начало следующей строки.",
            "Он завершает остаток частично набранного слова в команде."
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Какой протокол отвечает за управление размером сегментов и скоростью обмена сегментами между веб-клиентом и веб-сервером?",
        "answers": [
            "TCP",
            "IP",
            "HTTP",
            "Ethernet"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какой уровень отвечает за маршрутизацию сообщений в сети Интернет в модели TCP/IP?",
        "answers": [
            "internet",
            "transport",
            "network access",
            "session"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какое утверждение точно описывает процесс инкапсуляции TCP/IP, когда ПК отправляет данные в сеть?",
        "answers": [
            "Данные передаются с уровня Интернета на уровень доступа к сети.",
            "Пакеты отправляются с уровня доступа к сети на транспортный уровень.",
            "Сегменты отправляются с транспортного уровня на интернет-уровень.",
            "Кадры отправляются с уровня доступа к сети на уровень Интернета."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какой уникальный адрес встроен в сетевую карту Ethernet и используется для связи в сети Ethernet?",
        "answers": [
            "host address",
            "IP address",
            "MAC address",
            "network address"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Сетевой администратор устраняет проблемы с подключением на сервере. Используя тестер, администратор замечает, что сигналы, генерируемые сетевой картой сервера, искажены и непригодны для использования. На каком уровне модели OSI классифицируется ошибка?",
        "answers": [
            "presentation layer",
            "network layer",
            "physical layer",
            "data link layer"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Сетевой администратор измеряет передачу битов по магистрали компании для критически важного финансового приложения. Администратор замечает, что пропускная способность сети кажется ниже ожидаемой. Какие три фактора могут повлиять на разницу в пропускной способности? (Выберите три.)",
        "answers": [
            "объем трафика, который в настоящее время проходит через сеть",
            "сложность метода инкапсуляции, применяемого к данным",
            "тип трафика, проходящего через сеть",
            "задержка, создаваемая количеством сетевых устройств, через которые проходят данные",
            "пропускная способность WAN-соединения с Интернетом",
            "надежность инфраструктуры гигабитного Ethernet магистрали"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какая процедура используется для уменьшения эффекта перекрестных помех в медных кабелях?",
        "answers": [
            "требующие правильного подключения заземления",
            "скручивание пар проводов противоположных цепей вместе",
            "обертывание пучка проводов металлическим экраном",
            "проектирование кабельной инфраструктуры для предотвращения перекрестных помех",
            "избегать резких изгибов при монтаже"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Что является характеристикой подуровня LLC?",
        "answers": [
            "Он обеспечивает необходимую логическую адресацию, которая идентифицирует устройство.",
            "Он обеспечивает разграничение данных в соответствии с требованиями физической сигнализации среды.",
            "Он размещает информацию в кадре, позволяя нескольким протоколам уровня 3 использовать один и тот же сетевой интерфейс и носитель.",
            "Он определяет программные процессы, которые предоставляют услуги физическому уровню."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какой метод используется для управления доступом на основе соперничества в беспроводной сети?",
        "answers": [
            "CSMA/CD",
            "priority ordering",
            "CSMA/CA",
            "token passing"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Что происходит во время процесса инкапсуляции на канальном уровне для ПК, подключенного к сети Ethernet?",
        "answers": [
            "Добавляется IP-адрес.",
            "Добавляется логический адрес.",
            "Добавляется физический адрес.",
            "Добавляется номер порта процесса."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какие три основные функции обеспечивает инкапсуляция данных на уровне 2? (Выберите три.)",
        "answers": [
            "исправление ошибок с помощью метода обнаружения столкновений",
            "управление сеансами с помощью номеров портов",
            "адресация на канальном уровне",
            "размещение и удаление кадров из носителя",
            "обнаружение ошибок с помощью вычислений CRC",
            "разделение групп битов на кадры",
            "преобразование битов в сигналы данных"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Каковы две характеристики MAC-адресов Ethernet? (Выберите две.)",
        "answers": [
            "Они глобально уникальны.",
            "Они доступны для маршрутизации в Интернете.",
            "Они выражаются в виде 12 шестнадцатеричных цифр.",
            "MAC-адреса используют гибкую иерархическую структуру.",
            "MAC-адреса должны быть уникальными как для Ethernet, так и для последовательных интерфейсов устройства."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Если устройство получает кадр Ethernet размером 60 байт, что оно будет делать?",
        "answers": [
            "уронить кадр",
            "обрабатывать кадр как есть",
            "отправить сообщение об ошибке на отправляющее устройство",
            "добавить случайные байты данных, чтобы сделать его длиной 64 байта, а затем переслать его"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Что будет делать узел в сети Ethernet, если он получит кадр с MAC-адресом назначения, который не совпадает с его собственным MAC-адресом?",
        "answers": [
            "Это приведет к отбрасыванию кадра.",
            "Он пересылает кадр следующему узлу.",
            "Это позволит удалить рамку с носителя.",
            "Он отделяет кадр канала передачи данных, чтобы проверить IP-адрес назначения."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "При каких двух обстоятельствах коммутатор будет пересылать кадр из всех портов, кроме порта, на который был получен кадр? (Выберите два.)",
        "answers": [
            "Кадр имеет широковещательный адрес в качестве адреса назначения.",
            "Адрес назначения неизвестен коммутатору.",
            "Адрес источника в заголовке кадра является широковещательным адресом.",
            "Адрес источника в кадре является многоадресным адресом.",
            "Адрес назначения в кадре - это известный одноадресный адрес."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какой метод коммутации имеет самый низкий уровень задержки?",
        "answers": [
            "cut-through",
            "store-and-forward",
            "fragment-free",
            "fast-forward"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Какие две команды можно использовать на хосте Windows для отображения таблицы маршрутизации? (Выберите две.)",
        "answers": [
            "netstat -s",
            "route print",
            "show ip route",
            "netstat -r",
            "tracert"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какие две функции являются основными функциями маршрутизатора? (Выберите две.)",
        "answers": [
            "пересылка пакетов",
            "микросегментация",
            "разрешение доменных имен",
            "выбор пути",
            "управление потоком"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какие три диапазона IP-адресов зарезервированы для внутреннего частного использования? (Выберите три.)",
        "answers": [
            "10.0.0.0/8",
            "64.100.0.0/14",
            "127.16.0.0/12",
            "172.16.0.0/12",
            "192.31.7.0/24",
            "192.168.0.0/16"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Для какой цели служит NAT64 в IPv6?",
        "answers": [
            "Он преобразует пакеты IPv6 в пакеты IPv4.",
            "Он переводит частные IPv6-адреса в публичные IPv6-адреса.",
            "Это позволяет компаниям использовать в сети уникальные локальные адреса IPv6.",
            "Он преобразует обычные адреса IPv6 в 64-битные адреса, которые можно использовать в Интернете.",
            "Он преобразует 48-битный MAC-адрес в 64-битный адрес хоста, который может быть использован для автоматической адресации хостов."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Каково двоичное представление 0xCA?",
        "answers": [
            "10111010",
            "11010101",
            "11001010",
            "11011010"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Как минимум, какой адрес требуется на интерфейсах с поддержкой IPv6?",
        "answers": [
            "link-local",
            "уникальный местный",
            "сайт местный",
            "глобальная одноадресная рассылка"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какая служба обеспечивает динамическую глобальную адресацию IPv6 для конечных устройств без использования сервера, который ведет учет доступных адресов IPv6?",
        "answers": [
            "DHCPv6 с контролем состояния",
            "SLAAC",
            "статическая адресация IPv6",
            "DHCPv6 без статического режима"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какова цель команды ping ::1?",
        "answers": [
            "Он проверяет внутреннюю конфигурацию узла IPv6.",
            "Он проверяет широковещательную способность всех хостов в подсети.",
            "Он проверяет многоадресную связь со всеми хостами в подсети.",
            "Он проверяет достижимость шлюза по умолчанию для сети."
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Сколько полезных IP-адресов доступно в сети 192.168.1.0/27?",
        "answers": [
            "256",
            "254",
            "62",
            "30",
            "16",
            "32"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Какая подсеть будет включать адрес 192.168.1.96 в качестве полезного адреса хоста?",
        "answers": [
            "192.168.1.64/26",
            "192.168.1.32/27",
            "192.168.1.32/28",
            "192.168.1.64/29"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Администратор сети хочет иметь одну и ту же маску подсети для трех подсетей на небольшом сайте. На сайте имеются следующие сети и количество устройств:",
        "answers": [
            "255.255.255.0",
            "255.255.255.240",
            "255.255.255.248",
            "255.255.255.252"
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какое утверждение верно в отношении маскирования подсети переменной длины?",
        "answers": [
            "Каждая подсеть имеет одинаковый размер.",
            "Размер каждой подсети может быть разным, в зависимости от требований.",
            "Подсети можно объединять в подсети только один дополнительный раз.",
            "Биты возвращаются, а не заимствуются, для создания дополнительных подсетей."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какая маска подсети необходима, если в сети IPv4 имеется 40 устройств, которым нужны IP-адреса, а адресное пространство не должно расходоваться впустую?",
        "answers": [
            "255.255.255.0",
            "255.255.255.128",
            "255.255.255.192",
            "255.255.255.224",
            "255.255.255.240"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какие две характеристики являются общими для TCP и UDP? (Выберите две.)",
        "answers": [
            "размер окна по умолчанию",
            "бесконтактная связь",
            "нумерация портов",
            "3-стороннее рукопожатие",
            "способность передавать оцифрованный голос",
            "использование контрольной суммы"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Почему номера портов включаются в TCP-заголовок сегмента?",
        "answers": [
            "указать правильный интерфейс маршрутизатора, который должен использоваться для пересылки сегмента",
            "для определения того, какие порты коммутатора должны принимать или пересылать сегмент",
            "определить, какой протокол уровня 3 следует использовать для инкапсуляции данных",
            "чтобы принимающий хост мог направить данные в соответствующее приложение",
            "чтобы принимающий хост мог собрать пакет в правильном порядке"
        ],
        "correctAnswer": "3"
    },
    {
        "question": "Какими двумя способами TCP использует порядковые номера в сегменте? (Выберите два.)",
        "answers": [
            "для определения отсутствующих сегментов в пункте назначения",
            "для сборки сегментов на удаленном объекте",
            "для указания порядка, в котором сегменты перемещаются от источника к месту назначения",
            "ограничить количество сегментов, которые могут быть отправлены с интерфейса за один раз",
            "чтобы определить, изменился ли пакет во время транспортировки"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какие два протокола работают на самом верхнем уровне стека протоколов TCP/IP? (Выберите два.)",
        "answers": [
            "DNS",
            "Ethernet",
            "IP",
            "POP",
            "TCP",
            "UDP"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Какое доменное имя является примером домена верхнего уровня?",
        "answers": [
            "www.cisco.com",
            "cisco.com",
            ".com",
            "root.cisco.com"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "В чем разница между моделями клиент-сервер и одноранговой сети?",
        "answers": [
            "Только в модели клиент-сервер может происходить передача файлов.",
            "Каждое устройство в одноранговой сети может функционировать как клиент или сервер.",
            "В одноранговой сети данные передаются быстрее, чем в сети клиент-сервер.",
            "Передача данных с использованием устройства, выступающего в роли клиента, требует наличия выделенного сервера."
        ],
        "correctAnswer": "1"
    },
    {
        "question": "Какая сетевая модель используется, когда автор загружает документ с одной главой на файловый сервер книжного издательства?",
        "answers": [
            "peer-to-peer",
            "master-slave",
            "client/server",
            "point-to-point"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Беспроводной хост должен запросить IP-адрес. Какой протокол будет использоваться для обработки запроса?",
        "answers": [
            "FTP",
            "HTTP",
            "DHCP",
            "ICMP",
            "SNMP"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какая сетевая служба преобразует URL-адрес, введенный на компьютере, в IP-адрес сервера назначения?",
        "answers": [
            "DNS",
            "DHCP",
            "FTP",
            "SNMP"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Сетевой инженер анализирует отчеты недавно проведенной базовой линии сети. Какая ситуация отражает возможную проблему задержки?",
        "answers": [
            "изменение пропускной способности в соответствии с выводом show interfaces",
            "таймаут следующего узла при трассировке маршрута",
            "увеличение времени отклика на запрос ping между хостами",
            "изменение объема оперативной памяти в соответствии с выводом show version"
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какая функция брандмауэра используется для обеспечения того, чтобы пакеты, поступающие в сеть, были легитимными ответами на запросы, инициированные с внутренних узлов?",
        "answers": [
            "проверка пакетов с контролем состояния",
            "Фильтрация URL-адресов",
            "фильтрация приложений",
            "фильтрация пакетов"
        ],
        "correctAnswer": "0"
    },
    {
        "question": "Что является одним из признаков того, что компьютер Windows не получил адрес IPv4 от сервера DHCP?",
        "answers": [
            "Компьютер не может выполнить ping 127.0.0.1.",
            "Windows отображает сообщение о таймауте DHCP.",
            "Компьютер получает IP-адрес, начинающийся с 169.254.",
            "Компьютер не может пинговать другие устройства в той же сети с IP-адресами в диапазоне 169.254.0.0/16."
        ],
        "correctAnswer": "2"
    },
    {
        "question": "Какую команду может выдать администратор на маршрутизаторе Cisco для отправки отладочных сообщений на линии vty?",
        "answers": [
            "terminal monitor",
            "logging console",
            "logging buffered",
            "logging synchronous"
        ],
        "correctAnswer": "0"
    }
]